// rsc -> 엔터치면 단축키 후다다닥
// JSX는 if문을 사용할 수 없기 떄문에 삼항 연산자를 지원한다.
// 조건식 ? 참일 때 랜더링할 JSX : 거짓일 떄 랜더링할 JSX
// 조건식 && 참일 때 랜더링 할 JSX, 거짓이며 아무것도 출력되지 않음
// && 연산자는 앞의 조건식이 false이면 뒤는 실행하지 않으며, false라는 값은랜더링 되지 않음

import React from 'react';

const Jsx04 = () => {

  // || 초기값 사용
  // if문은 사용하면 안됨 >>> 삼항으로 써야함

  const name = undefined || "이진아";
  const login = true;
  const guest = true;
 
 return (
  <div>
    { login && guest && (
     <h1>비회원으로 로그인 되었습니다.</h1>
    )}
    { login ? (
       <h1>{name}님 환영합니다.🤗</h1>
    ) : (
       <h1>로그인 실패 🤣</h1>
    ) }
  </div>
 );
};

export default Jsx04;